{
  "event": {
    "title": "GSoC Demo Day 2025",
    "meetlink": "https://meet.google.com/yfm-sfvp-svw",
    "time_and_date": {
      "start": "2025-08-21T11:00:00",
      "end": "2025-08-21T17:05:00"
    },
    "location": "Online",
    "ticket": "Community Ticket Free",
    "Overview": "Join us in the 2025 of our GSoC Demo Day! This will be our 9th year participating in GSoC, and we'll take the opportunity to bring past contributors and students to share their experiences in this virtual event - with an intro by our own founder and project leader, Gabriel Engel.",
    "sessions": [
           {
        "start_time": "11:00"
        "end_time": "11:20",
        "title": "Welcome Note",
        "speaker": "Gabriel Engel",
        "duration": 20,
        "yt_link": ""
      },
      {
        "start_time": "11:20",
        "end_time": "11:35",
        "title": "GSOC Community Hub 2025"
        "speaker": "Daniel Akinola",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "11:35",
        "end_time": "11:50",
        "title": "End to End Encrypted Message Handling for Ruqola",
        "speaker": "Andro Rano",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "11:50",
        "end_time": "12:05",
        "title": "Convert endpoints to new Pattern",
        "speaker": "Ahmed Abdel-Twab",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "12:05",
        "end_time": "12:15",
        "title": "Break",
        "speaker": "",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "12:15",
        "end_time": "12:30",
        "title": "Receipts Processor and Reporting App powered by Multi-modal LLMs",
        "speaker": "William Liu",
        "duration": 15,
        "description": ""
      },
      {
        "start_time": "12:30",
        "end_time": "12:45",
        "title": "Natural Language Bridge to Legacy Email",
        "speaker": "Priyanshu Harshbodhi"
        "duration": 15,
        "description": ""
      },
      {
        "start_time": "12:45",
        "end_time": "13:00",
        "title": "AI Enhanced Message Composer Component",
        "speaker": "Ayush",
        "duration": 15,
        "description": ""
      },
      {
        "start_time": "13:00",
        "end_time": "13:10",
        "title": "Break",
        "speaker": "",
        "duration": 1,
        "yt_link": ""
      },
      {
        "start_time": "13:10",
        "end_time": "13:25",
        "title": "Trip Helper App",
        "speaker": "Piyush Bhatt",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "13:25",
        "end_time": "13:40",
        "title": "Code Review AI Assistant App for Rocket.Chat",
        "speaker": "Jannat",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "13:40",
        "end_time": "13:55",
        "title": "AI Chat Workflows Automation App with multi-step reasoning",
        "speaker": "Dhairyashil Shinde",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "13:55",
        "end_time": "14:05",
        "title": "",
        "speaker": "Break",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "14:05",
        "end_time": "14:20",
        "title": "Jinghan Yu",
        "speaker": "",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "14:20",
        "end_time": "14:35",
        "title": "Message Timestamp Date Picker Components",
        "speaker": "Ishan Mitra",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "14:35",
        "end_time": "14:50",
        "title": "Passkey-Based WebAuthn Authentication for Rocket.Chat",
        "speaker": "Fang Zihao",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "14:50",
        "end_time": "15:00",
        "title": "Break",
        "speaker": "",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "15:00",
        "end_time": "15:15",
        "title": "Fuselage React Native compatibility (tamagui)",
        "speaker": "Thanisha Dewangan",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "15:15",
        "end_time": "15:30",
        "title": "Log in via QR code using mobile app",
        "speaker": "Jinendra Jain",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "15:30",
        "end_time": "15:45",
        "title": "Implement visual regression testing",
        "speaker": "Anshul",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "15:45",
        "end_time": "15:55",
        "title": "Break",
        "speaker": "",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "15:55",
        "end_time": "16:10",
        "title": "Maestro as Mobile UI Testing Framework",
        "speaker": "Rohit Bansal",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "16:10",
        "end_time": "16:25",
        "title": "Messages scheduling",
        "speaker": "Thotsem Jajo",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "16:25",
        "end_time": "16:40",
        "title": "Server Guide Agent",
        "speaker": "Abir Chakraborty",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "16:40",
        "end_time": "16:50",
        "title": "Break",
        "speaker": "",
        "duration": 15,
        "yt_link": ""
      },
      {
        "start_time": "16:50",
        "end_time": "17:05",
        "title": "Private Teams and Private Channels Administration Improvements",
        "speaker": "Lexie Huang",
        "duration": 15,
        "yt_link": ""
      },
        {
        "start_time": "17:05",
        "end_time": "17:15",
        "title": "Closing Notes",
        "speaker": "",
        "duration": 15,
        "yt_link": ""
      },
    ],
    "speakers": [
      {
        "name": "Gabrial Engel",
        "bio": "Founder of Rocket.Chat.",
        "image": "https://open.rocket.chat/avatar/gabriel.engel",
        "more": "Creating the platform for human collaboration over the Internet, powered by the global open source community.",
        "social": [
          {
            "github": "https://github.com/engelgabriel"
          },
          {
            "email": "gabriel.engel@rocket.chat"
          },
          {
            "twitter": "https://twitter.com/gabriel_engel"
          },
          {
            "linkedin": "https://br.linkedin.com/in/gabrielengel"
          }
        ]
      },
      {
        "name": "Sing Li",
        "bio": "Community Manager at Rocket.chat",
        "image": "https://open.rocket.chat/avatar/sing.li",
        "more": "Creating the platform for human collaboration over the Internet, powered by the global open source community.",
        "social": [
          {
            "github": "https://github.com/Sing-Li"
          },
          {
            "email": "sing.li@rocket.chat"
          },
          {
            "twitter": "https://github.com/Sing-Li"
          },
          {
            "linkedin": "https://www.linkedin.com/in/sing-li-119716139"
          }
        ]
      },
      {
        "name": "Ahmed Abdel-Twab",
        "bio": "passionate about developing backends and databases that ensure applications run smoothly",
        "image": "https://media.licdn.com/dms/image/v2/D4D03AQHhy5JPupGGeg/profile-displayphoto-shrink_800_800/B4DZcIHQ2DG8Ak-/0/1748187816130?e=1758153600&v=beta&t=DQ2tqbbB8XO27rlhqdRlvKeNJx8ehmQ5iWbPpjUer9A",
        "more": "I'm a huge fan of technology, especially apps and tools that make life easier for developers and everyday users alike. I'm always messing around with new tech, looking for the best ways to write clean, efficient, and understandable code. I enjoy helping others, whether it's explaining complex code, fixing bugs, or simplifying technical concepts for my teammates and the wider community. Fun Fact: My cat has been trying to learn how to type, but so far, she only knows the 'delete' key.",
        "social": [
          {
            "github": ""
          },
          {
            "email": "ahmed.n.abdeltwab@gmail.com"
          },
          {
            "twitter": ""
          },
          {
            "linkedin": "https://www.linkedin.com/in/ahmed-n-abdeltwab"
          }
        ]
      },
      {
        "name": "William Liu",
        "bio": "I'm currently a software engineer at Gojek, working on GoFood. I have experience in backend and DevOps, and I focus on building reliable, scalable systems that support everyday use at scale.",
        "image": "https://drive.google.com/file/d/1TalKtw9iYkKt58XH9F-icGUFXYreAcwg/view?usp=sharing",
        "more": "I'm a software engineer at Gojek, currently working on GoFood. I started my journey in tech after finishing my undergraduate thesis and joining Gojek’s Engineering Bootcamp, where I learned a lot about backend, DevOps, and mobile development.\n\nI mostly work with Go and have experience with tools like Kubernetes, Prometheus, and Grafana. I enjoy building backend systems that are reliable, easy to maintain, and can handle a lot of traffic. I'm also interested in DevOps practices that help teams move fast without breaking things.\n\nOutside of work, I like learning new things, solving coding problems, reading novels, playing video games and working on side projects and now trying to contribute to open source projects",
        "social": [
          {
            "linkedin": "https://www.linkedin.com/in/william160902/"
          },
          {
            "email": "ashborne16@gmail.com"
          }
        ]
      },
      {
        "name": "Thotsem Jajo",
        "bio": "I’m a builder at heart — from web apps to dev tools. With experience ranging from backend services to UI optimization, I’m currently contributing to Rocket.Chat through Google Summer of Code 2025.",
        "image": "https://drive.google.com/file/d/1aZYu1Ffgyjy-bEYgClDbxHkTtY-3gf0-/view",
        "more": "Hi, I’m Thotsem Jajo, currently a GSoC’25 contributor at Rocket.Chat, MCA student, and someone who truly enjoys the process of building good software.\n\nI’ve always been drawn to open source: the spirit of sharing, the challenge of real codebases, and the satisfaction of shipping something that helps thousands. Through GSoC, I’ve been developing Rocket.Chat’s scheduled messaging feature, bringing together backend logic and real-time user experience.\n\nI’ve worked as an intern, taken on few side gigs, and built personal tools that reflect my love for fullstack development. Some of my personal projects include a tool for tunneling local servers online and an image upload and processing system. I enjoy creating tools that solve actual problems, no matter how niche.\n\nWhile I lean more towards backend development, where I love designing APIs, architecting systems, and solving performance bottlenecks, I am equally immersed in the frontend world.\n\nWhat excites me most about tech is not just learning new frameworks, but using them to solve real, messy problems alongside others who love to build as much as I do.\n\nIf you're into open source, building useful tools, or just want to geek out about JavaScript performance quirks, I'm your guy.",
        "social": [
          {
            "github": "https://github.com/sem22-dev/"
          },
          {
            "email": "Thotsemj@gmail.com"
          }
        ]
      },
      {
        "name": "Abir Chakraborty",
        "bio": "I'm a GSoC'25 contributor at Rocket.Chat and a Computer Science student at Jadavpur University, passionate about open source.",
        "image": "https://res.cloudinary.com/dcysmbtrn/image/upload/v1752821243/my_pic_w9hmmf.png",
        "more": "I love exploring AI and building useful things with it. As part of my GSoC project, Server Guide Agent at Rocket.Chat, I’ve utlized large language models to provide intelligent onboarding guides for users. I enjoy contributing to open-source software, it’s a great way to learn.",
        "social": [
          {
            "github": "https://github.com/abirc8010"
          },
          {
            "email": "abirc8010@gmail.com"
          }
        ]
      },
      {
        "name": "Priyanshu Harshbodhi",
        "bio": "I'm a curious person and currently on the hunt for what's next big thing(for building a startup).",
        "image": "https://drive.google.com/file/d/1hfHMjycp9WhuYlVI_3J847O5-Qo9uzZJ/view?usp=sharing",
        "more": "I spend most of my time learning, coding, experimenting, and applying my knowledge. Open Source was a great journey to learn and have industry level experienc for me. Hackathons are where I come alive, I am taking part in lot of hackathons currently. \n\nI am thrilled to be preset in this period with unprecedented opportunities due to AI boom. My long-term goal? To launch a tech startup, get accepted in YC & move to silicon valley — and have a blast doing it.\n\nApart from above thing I also like reading stuff on varied fields like economics, politics, latest development in bio-tech etc.",
        "social": [
          {
            "github": "https://www.linkedin.com/in/priyanshu-harshbodhi/\nhttps://x.com/PriyanHB\nhttps://github.com/priyanshuharshbodhi1"
          },
          {
            "email": "priyanshuqpwp@gmail.com"
          }
        ]
      },
      {
        "name": "Ayush Kumar",
        "bio": "If tech had a hero’s journey, I’d be the underdog-turned-architect – from decoding algorithms like plot twists to building full-stack systems with the precision of a director. I don’t just code; I craft stories in logic, optimize like an editor, and ship like it's opening night. ",
        "image": "https://drive.google.com/file/d/1djdEW3aeRcjquE0IBMym0uLpo4swm6BN/view?usp=sharing",
        "more": "It all began in a small town in India, where I first laid eyes on a computer around 2007or 08. Even then, my imagination was captured not by the screen itself, but by the power of science, especially physics and mathematics. As a child, I devoured every math competition and Olympiad I could find, chasing that exhilarating “aha!” moment with each solved problem.\n\nThat early passion steered me through countless hours of study and problem‑solving, ultimately leading me to crack the grueling IIT entrance exam out of over a million aspirants to earn a spot at one of India’s most prestigious engineering institutions, home to visionaries like Sundar Pichai (CEO of Alphabet), Arvind Srinivas (founder of perplexity), and Arvind Krishna (CEO of IBM). Walking those campus corridors, I felt the weight of that legacy and knew I was exactly where I was meant to be.\n\nOnce on campus, I discovered a new obsession: programming and software development. I immersed myself in hackathons, open‑source projects, and late‑night coding competitions. \n\nThis year I completed my bachelors going to the real world where more things still hides to be explored.",
        "social": [
          {
            "linkedin": "https://www.linkedin.com/in/ayush-kumar-842154225/"
          },
          {
            "email": "ayushjitendra28@gmail.com"
          }
        ]
      },
      {
        "name": "Daniel Akinola",
        "bio": "I like math, programming, interesting software and video games.",
        "image": "https://www.linkedin.com/in/daniel-akinola-565870265",
        "more": "I like math, programming, interesting software and video games.",
        "social": [
          {
            "github": "https://github.com/adaniel105"
          },
          {
            "email": "dakinola18@gmail.com"
          }
        ]
      },
      {
        "name": "Piyush Bhatt",
        "bio": "I’m a passionate coder who thrives on solving complex problems, pushing my mind to its deepest limits",
        "image": "https://media.licdn.com/dms/image/v2/D4D03AQF4h-WN3_ONag/profile-displayphoto-shrink_400_400/profile-displayphoto-shrink_400_400/0/1720375224466?e=1755734400&v=beta&t=BMTBLS_xjIk8bQxTacngf5LFIQCUOSCw5WagXdy4l2k",
        "more": "I see myself as a passionate coder who loves diving deep into complex problems, often spending countless late nights debugging lines of code, driven by an unwavering desire to deliver the best possible features, no matter how challenging they are.",
        "social": [
          {
            "linkedin": "https://www.linkedin.com/in/piyush-bhatt-713866288/"
          },
          {
            "email": "bhattpiyush303@gmail.com"
          }
        ]
      },
      {
        "name": "Jannat Khan",
        "bio": "I am a self-taught programmer and AI generalist, I work on all things AI. I am also a SheFi scholar where I am exploring Web3 world.",
        "image": "https://i.postimg.cc/YrH7pZKF/5467-C187-3-B66-41-C8-B823-EC192-E3-D7-F4-F.png?dl=1",
        "more": "I am Mathematics and Computing graduate, I am a self-taught programmer, my coding journey began in +1 when I opted for Computer Science. Fast forward to college, I got enrolled into several Udemy courses and became AI native and ramped up myself on all things AI.",
        "social": [
          {
            "email": "jannatkhandev@gmail.com"
          }
        ]
      },
      {
        "name": "Lexie Huang",
        "bio": "GSoC contributor focused on improving private team and channel administration. I’m curious about amazing product ideas and love exploring real-world applications of ML and LLMs.",
        "image": "https://www.linkedin.com/in/lexie-h/",
        "more": "I studied Statistics and Computing at UWaterloo and will soon begin my Master’s in CSE at Georgia Tech. This summer, I’ve been working with Rocket.Chat to improve private team and channel administration, diving deep into permission logic and testing. During my four years of undergrad, I did five internships (for credits to graduate…), rotating through roles in DS, SWE, finance, and venture capital. Each one gave me a different lens on tech, markets, and impact. But after all the experimenting, I’m happiest when I’m building, when I’m writing code and creating something that might actually help people. (Also, five internships in four years means I had to move every four months… great for character building, less great for my back.)",
        "social": [
          {
            "linkedin": "https://www.linkedin.com/in/lexie-h/"
          },
          {
            "email": "huangziqian0417@gmail.com"
          }
        ]
      },
      {
        "name": "Dhairyashil Shinde",
        "bio": "Engineer passionate about building intelligent, accessible, and scalable apps.",
        "image": "https://media.licdn.com/dms/image/v2/D4D03AQF9LIh-EgcCQA/profile-displayphoto-shrink_800_800/profile-displayphoto-shrink_800_800/0/1731130595077?e=1755734400&v=beta&t=VYmAdev2exTuJftaziuH6u4o-ytr4dqnid2zfIq0JJs",
        "more": "Hey! I'm an engineer who thrives at the intersection of AI, web performance, and user experience.\n\nRight now, I’m a Google Summer of Code 2025 contributor with Rocket.Chat, where I’m building a powerful AI-driven chat automation tool that turns natural language into complex workflows",
        "social": [
          {
            "linkedin": "https://www.linkedin.com/in/dhairyashilshinde/"
          },
          {
            "email": "dhairyashil10101010@gmail.com"
          }
        ]
      },
      {
        "name": "Jinghan Yu",
        "bio": "I’m a full-stack developer passionate about building clean, intuitive, and user-centric solutions that solve real problems. Experienced in Java and React, I focus on creating scalable, efficient products and enjoy contributing to open source to make technology that truly helps people.",
        "image": "https://media.licdn.com/dms/image/v2/D4E03AQHyv4gMg860mg/profile-displayphoto-shrink_800_800/profile-displayphoto-shrink_800_800/0/1721349029104?e=1756339200&v=beta&t=x1MosfnMDjif9PqdhA1_s8Sv0Yi3kLpTZhStZndz5Lw",
        "more": "I didn’t start coding just to write programs. I started because I love solving real problems. Over time, I’ve worked on projects ranging from academic systems that help schools run more smoothly to inventory systems that streamline company operations. These experiences taught me how much user-centric design and even the smallest technical details can change how people work and interact with technology.\n\nContributing to open source has been a big part of my growth. Collaborating with other developers taught me how to write cleaner, more maintainable code, how to communicate ideas clearly, and how to build features that fit well into large collaborative projects. It is still amazing to me that a few lines of code can improve a tool used by thousands of people.\n\nI am also curious about how technology can improve education and knowledge sharing. I believe this is an area where tech can truly change lives. I am a bit of a perfectionist and also a night owl. The quiet hours are when I think most clearly and refine things until they feel just right.",
        "social": [
          {
            "github": "https://github.com/jhanyu2019"
          },
          {
            "email": "yujinghan0525@gmail.com"
          }
        ]
      },
      {
        "name": "Ishan Mitra",
        "bio": "Grown up with a home PC since Windows 98 - unassembled and reassembled a PC when I was 7 - created my first webpage using Microsoft FrontPage - gaming led me to appreciate and pursue a developer career",
        "image": "https://drive.google.com/file/d/1zV6cj3VvlP55AS6jyXIwXe4PnST3WsNJ/view?usp=sharing",
        "more": "My interest in programming stems from my exposure to gaming when I was young. Early childhood memories include trying to develop a clone of classic 2D games such as Pacman, Blockout, and Space Invaders.\nI always approached learning a new computer language as a hobby and interest during my school years, rather than understanding the nuances and the philosophy behind why it was created in the first place.\nIt is interesting to think that had I not been utterly frustrated with an OpenCV project, I would not have given any thought to participating in GSoC. In fact, my journey towards this OpenCV project started way back in 2022 when I got accepted by AWS to understand MLOps. AI has come so far since then.\nI love to travel, learn new languages and I have been to Vietnam, Singapore, Malaysia and the UAE. I am also eagerly learning new languages, especially Japanese and Vietnamese.",
        "social": [
          {
            "linkedin": "https://www.linkedin.com/in/ishan-mitra/"
          },
          {
            "email": "iamishan1996@gmail.com"
          }
        ]
      },
      {
        "name": "Fang Zihao",
        "bio": "Good at coding.",
        "image": "https://drive.google.com/file/d/1FSipQb4V4MiyuPzyT9_Fng27-jPnEoqL/view?usp=drive_link",
        "more": "I am a Full Stack Developer who skilled in Java, Vue, React, Python and have experience in Next.js, C++, Android, ReactNative, UniApp. Also interested in Web3, Cybersecurity and AI. ",
        "social": [
          {
            "email": "fzh075@outlook.com"
          }
        ]
      },
      {
        "name": "Thanisha Dewangan",
        "bio": "A curious builder and AI enthusiast passionate about solving real-world problems with code. Currently a GSoC contributor at Rocket.Chat, I’ve led scalable product builds, explored AI in healthcare, and contributed to open source. I thrive where impact meets innovation.",
        "image": "https://drive.google.com/file/d/1AGmJURNaGBwGihBCOszQRZkpJDrniC6r/view?usp=sharing",
        "more": "I’m Thanisha Dewangan, a developer, open-source contributor, and passionate problem-solver. My journey into tech started with curiosity and scaled into impact—most recently as a Google Summer of Code (GSoC) contributor with Rocket.Chat, where I worked on real-time collaboration tools and enhanced cross-platform design components.\n\nWith internships at Amazon and various startups, I’ve designed and shipped full-stack applications, optimized backend services, and implemented machine learning models—one of which helps detect diabetic retinopathy from retinal scans. I’ve also co-authored research on YOLOv9-based object detection and non-invasive blood glucose prediction using ML.\n\nBeyond the code, I enjoy mentoring juniors, designing intuitive user experiences, and exploring how tech can drive social good. I’m deeply inspired by AI’s intersection with accessibility and healthcare, and I aim to build systems that make a real difference in people’s lives.\n\nYou’ll usually find me balancing hackathons, GitHub commits, and long walks listening to tech podcasts—or geeking out over clean UI. I'm always up for meaningful collaboration, especially where impact and creativity intersect.",
        "social": [
          {
            "linkedin": "https://www.linkedin.com/in/thanisha-dewangan-b89720276/"
          },
          {
            "email": "musudewangan01@gmail.com"
          }
        ]
      },
      {
        "name": "Andro Rano",
        "bio": "Professional bug researcher",
        "image": "",
        "more": "Professional bug researcher with specialization in c++, javascript/typescript etc...",
        "social": [
          {
            "linkedin": "https://www.linkedin.com/in/androranogajec/"
          },
          {
            "email": "ranogaet@gmail.com"
          }
        ]
      },
      {
        "name": "Jinendra Jain",
        "bio": "Full stack web & mobile developer focused on React Native and scalable backend systems. GSoC 2025 contributor @ Rocket.Chat, building real-world features that ship. Previously worked with YC-backed and US-based startups. I love building clean UIs, fast & scalable APIs, and solving meaningful problems.",
        "image": "https://drive.google.com/file/d/1W4YvgYw9E5KI3_lxfAVmxsJs56Ssrlf0/view?usp=sharing",
        "more": "I’m a Full Stack Web & Mobile Developer with a deep interest in building clean, scalable, and real-world software. I enjoy working across the stack, whether it's crafting smooth mobile experiences using React Native, building fast and reliable backends using Node.js, TypeScript, or Golang, or integrating complex systems to work.\n\nCurrently, I'm a GSoC 2025 contributor with Rocket.Chat, where I’m working on production-level features that improve the user experience for thousands of users. Prior to this, I’ve worked at two US-based startups, and a YC-backed startup, where I contributed to everything from API integrations to feature-rich UIs, often owning features end-to-end.\n\nOutside of internships and open source, I lead Google Developers Group (GDG) activities at my campus, where I help organize tech meetups, workshops, and foster a culture of learning and innovation.\n\nI’m a Computer Science undergrad (CSE’26), and while coding is my core, I also love chess, film making, public speaking, and building things that make a difference, like a flood-rescue app I built as part of a college hackathon, which was later showcased at an exhibition. I also built Codebrim, an online code-sharing and compiling platform with GitHub integration, designed to make collaborative coding faster and simpler.\n\nI thrive in fast-paced environments, care deeply about product quality, and love working with people who are equally driven to turn ideas into reality.",
        "social": [
          {
            "github": "LinkedIn: https://www.linkedin.com/in/jjinendra3/ ; GitHub: https://github.com/jjinendra3 ; X: https://x.com/jjinendra3 ; Instagram: https://www.instagram.com/hattori.03/"
          },
          {
            "email": "jjinendra3@gmail.com"
          }
        ]
      },
      {
        "name": "Anshul",
        "bio": "I’m especially curious about why Data Structures and Algorithms (DSA) are emphasized so much, even though real-world work often looks different from coding interview problems. My goal is to understand both: the theoretical foundation and the practical side of software development.",
        "image": "https://instagram.fixr5-1.fna.fbcdn.net/v/t51.2885-19/484213121_575550082181808_4064718712755775272_n.jpg?stp=dst-jpg_s150x150_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6InByb2ZpbGVfcGljLmRqYW5nby4xMDgwLmMyIn0&_nc_ht=instagram.fixr5-1.fna.fbcdn.net&_nc_cat=100&_nc_oc=Q6cZ2QFmaYQPQVMCSHG7A9cGOOUitwRtUVlePbfpHFEURGo1V2rhXqZyE-e-uo2fqU6s_KRIOBUKqW5ZRsfaf1OWnXSi&_nc_ohc=KIqhDPgYfUAQ7kNvwFOgDWv&_nc_gid=uKd95YKbhtp1lnBzTTumvw&edm=AOQ1c0wBAAAA&ccb=7-5&oh=00_AfR-jXhWXvpA7BOq3mb_qZfDsTOFrDxfQ_MUgjvC0QcSsw&oe=68895597&_nc_sid=8b3546",
        "more": "I’ve always been curious about what really happens inside a software company. Not just the shiny frontend or solving DSA problems for interviews, but the behind-the-scenes stuff—how code moves from a developer’s machine to a real-world product. That curiosity led me to explore open source, and I stumbled upon Rocket.Chat, which became my very first open source organization to contribute to.\n\nInitially, I was focused on web development, like most beginners. But as I dug deeper, I realized there’s a whole ecosystem beyond it:  CI/CD pipelines, testing,  and a lot of things that keep the software world running smoothly. It was both overwhelming and exciting to learn that writing code is just one piece of the puzzle.",
        "social": [
          {
            "github": "https://github.com/Anxhul10, https://www.linkedin.com/in/anshul-ekka-22943434a/"
          },
          {
            "email": "anxhul10@gmail.com"
          }
        ]
      },
      {
        "name": "Rohit Bansal",
        "bio": "I am a Javascript developer focused on building fast, scalable backends with Node.js and sleek cross-platform apps using React Native. I love solving real-world problems with clean architecture and performant code.",
        "image": "https://drive.google.com/file/d/1THFAx6MuSJwXoap2k6JaNXO2oMt_YwGq/view?usp=drivesdk",
        "more": "I don’t come from a computer science background, coding wasn’t something I studied formally. It all started as a passion. I first got into programming through PHP because I wanted to build websites. That led me to JavaScript, and once I saw what was possible, I got hooked. From there, I picked up Node.js and started writing backend applications. Then I found React and began creating full websites with it.\n\nBut honestly, building responsive websites started to wear me out. Making everything work across every screen size felt like a never-ending battle. That’s when I discovered React Native. Since it was based on React, it felt familiar, but the transition wasn’t as smooth as I expected.\n\nI started learning React Native around 2021, and back then, I didn’t have AI tools or ChatGPT or anything like that to guide me. No Copilot, no fancy autocomplete. I had to rely on Google, Stack Overflow, GitHub issues, and a lot of trial and error. I used to watch YouTube videos, pause every few seconds, try to follow along, and figure things out on my own. Some days I had to spend hours stuck on the smallest issue. But I am really happy I didn’t give up during that time.\n\nEventually, things started making sense. I loved how React Native made it possible to build apps for both Android and iOS with one codebase. It just felt right. That’s when I made the decision to leave web development behind and go all-in on mobile.\n\nNow, I am focused on building cross-platform mobile apps and learning more every day. I still face challenges, but I enjoy the process. Looking back, I am proud of how far I have come not because it was easy, but because I stuck with it.",
        "social": [
          {
            "github": "https://github.com/Rohit3523\nhttps://www.instagram.com/rohitbansal3631"
          },
          {
            "email": "rohitbansal272@gmail.com"
          }
        ]
      }
    ]
  }
}
